{
  "backend/main.mo": "Main Motoko actor defining Product, Sale, Category, and Settings types with CRUD operations for products, sales recording with stock validation, low stock queries, and PIN-based settings management.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (dashboard stats, low stock alerts, add product form, search, sales recording, etc.) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend source files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables for a green-themed mobile inventory app.",
  "frontend/index.html": "HTML entry point with mobile viewport settings, green theme color meta tag, and root div for React mounting.",
  "frontend/src/App.tsx": "Root React component managing screen navigation between six tabs, PIN lock screen state, and providing QueryClient and ThemeProvider context.",
  "frontend/src/components/AddProduct.tsx": "Form component for adding products with bilingual labels, category dropdown with Urdu translations, real-time profit calculation, and form validation.",
  "frontend/src/components/ChangePinDialog.tsx": "Modal dialog for changing the 4-digit PIN with visual dot indicators, numeric input validation, and mutation handling.",
  "frontend/src/components/Dashboard.tsx": "Dashboard component displaying statistics (total products, stock, low stock alerts, expected profit) and a list of low stock products using custom hooks and UI components.",
  "frontend/src/components/EditProductModal.tsx": "Modal dialog for editing product details (name, category, prices, quantity) with update and delete functionality using mutations and form inputs.",
  "frontend/src/components/Header.tsx": "Sticky header component displaying the app title 'Mobile Best' and subtitle 'Cash Point Inventory System' with gradient background.",
  "frontend/src/components/PinLockScreen.tsx": "Full-screen PIN lock interface with 4-digit input, unlock functionality, and PIN reset option to default (1234).",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying product details (name, category, prices, profit, stock) with Quick Sale and Edit buttons that trigger respective modals.",
  "frontend/src/components/QuickSaleDialog.tsx": "Dialog for quickly recording a sale with quantity input, stock validation, and profit calculation display.",
  "frontend/src/components/ReportCard.tsx": "Simple card component for displaying report metrics with title, period, value, and optional subtitle.",
  "frontend/src/components/Reports.tsx": "Reports page showing daily sales, monthly profit, and export buttons for full inventory and low stock reports using date range queries.",
  "frontend/src/components/SaleItem.tsx": "Component displaying individual sale record with product name, profit, quantity, and timestamp.",
  "frontend/src/components/Sales.tsx": "Sales recording interface with product selection, quantity input, total calculation, and today's sales history display.",
  "frontend/src/components/Search.tsx": "Search component that filters and displays products by name using a search input with icon, showing empty states for no query or no results.",
  "frontend/src/components/Settings.tsx": "Settings screen with toggles for app lock, PIN change dialog, backup/restore functionality, and a reset option with confirmation dialog.",
  "frontend/src/components/StatCard.tsx": "Reusable stat card component displaying a title, value, icon, and supporting three visual variants (default, alert, profit).",
  "frontend/src/components/TabBar.tsx": "Bottom navigation bar component with six tabs (dashboard, add, search, sales, reports, settings) for screen navigation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useLockScreen.ts": "Hook that manages app lock screen state based on settings, providing lock status and unlock function.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including products, sales, and settings CRUD operations with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light/dark themes, scrollbar hiding utilities, and fade-in animation.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/utils/backupHelpers.ts": "Utility functions for generating JSON backup files and restoring data from backup files (simplified implementation with placeholder logic).",
  "frontend/src/utils/exportHelpers.ts": "Provides functions to export inventory data as downloadable text files: a full report with summary statistics and product details, and a low stock report listing products below threshold.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing a mobile-first inventory management system (Mobile Best) with features for product tracking, sales recording, profit calculation, low stock alerts, PIN security, and data backup/restore using localStorage."
}